app/controllers/feeds_controller.rb

  def index
    response.headers['Cache-Control'] = 'public, max-age=300'
    @feeds = Feed.all
---
SELECT * FROM "feeds"

  def show
    @feeds = Feed.all
    @feed = Feed.find(params[:id])
---
SELECT * FROM "feeds"
SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)

  def create
    @feed = Feed.new(params[:feed])
    if @feed.save
---
INSERT INTO "feeds" ("name", "yql_query", "created_at", "image_url", "itunes_category", "itunes_keywords", "updated_at", "language", "sy_updateFrequency", "itunes_author", "sy_updatePeriod", "itunes_summary", "itunes_explicit", "itunes_owner_email", "atom_link_href", "itunes_image_href", "itunes_owner_name", "itunes_subtitle", "link", "description", "lastBuildDate", "image_link") VALUES('Sector Five Radio', '', '2010-07-12 05:01:18', '', 'Entertainment', 'radio, show, paranormal, supernatural, science, fiction', '2010-07-12 05:01:18', 'en', '1', 'Dice Media Group', 'daily', 'Sector Five explores supernatural activity anywhere in the world , interviews leading scientists, tells of fantastic enconters, and reviews the latest high-tech gear.', 'clean', 'carl@captproton.com', 'http://betamouse.net/feed/podcast/', 'http://feeds.feedburner.com/SectorFiveRadioShow', 'Dice Media Group', 'Positive paranormal radio that entertains.', 'http://sectorfiveradio.com', 'Big Foot, Aliens, Sci-Fi Tech, &#38; Gadgets, a weekly radio show and podcast from a crack team of geeks.', '2010-07-12', 'http://sectorfiveradio.com')

  def edit
    @feed = Feed.find(params[:id])
---
SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)

  def update
    @feed = Feed.find(params[:id])
    if @feed.update_attributes(params[:feed])
---
SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)
UPDATE "feeds" SET "updated_at" = '2010-07-12 05:18:15', "yql_query" = 'select title, description, link, guid, pubDate, enclosure.length, enclosure.type from feed where url="http://www.archive.org/advancedsearch.php?q=title%3A%28sector%29+AND+creator%3A%28dice+media+group%29&output=rss&callback=callback&save=yes" ' WHERE "id" = 1